{
    "person": {
        "role": "Desenvolvedor de Software"
    },
    "newsletter": {
        "title": "Inscreva-se na Newsletter do Michael",
        "description": "Ocasionalmente escrevo sobre desenvolvimento de software, tecnologia e compartilho ideias sobre boas práticas em engenharia backend.",
        "button": "Inscrever-se"
    },
    "home": {
        "label": "Início",
        "title": "Portfólio de Michael Morais",
        "description": "Site de portfólio exibindo meu trabalho como Desenvolvedor de Software",
        "headline": "Desenvolvedor de Software e Solucionador de Problemas",
        "subline": "Sou Michael, desenvolvedor de software na Embraer, onde construo sistemas escaláveis e eficientes. No meu tempo livre, trabalho em projetos pessoais e exploro novas tecnologias."
    },
    "about": {
        "label": "Sobre",
        "title": "Sobre mim",
        "description": "Conheça Michael, Desenvolvedor de Software de São José dos Campos, Brasil",
        "intro": {
            "title": "Introdução",
            "description": "Michael é um desenvolvedor de software baseado em São José dos Campos, apaixonado por escrever código limpo, escalável e eficiente. Sua especialidade inclui desenvolvimento backend, design de APIs e gerenciamento de banco de dados."
        },
        "work": {
            "title": "Experiência Profissional",
            "experiences": {
                "Embraer": {
                    "timeframe": "2023 - Presente",
                    "role": "Desenvolvedor de Software Júnior",
                    "achievements": "Desenvolveu e otimizou sistemas internos, melhorando o desempenho e a eficiência.; Trabalhou no desenvolvimento de APIs backend para aprimorar o processamento de dados e a escalabilidade do sistema."
                },
                "Freelancer & Projetos Pessoais": {
                    "timeframe": "2021 - Presente",
                    "role": "Desenvolvedor de Software",
                    "achievements": "Criou o ProFit, uma plataforma de rastreamento de treinos com autenticação baseada em funções.; Desenvolveu diversos projetos pessoais utilizando Node.js, TypeScript e PostgreSQL."
                }
            }
        },
        "studies": {
            "title": "Formação Acadêmica",
            "institutions": {
                "Universidade Paulista (UNIP)": {
                    "description": "Cursando Ciência da Computação, com previsão de formatura em 2025."
                },
                "FATEC Jacareí": {
                    "description": "Estudou princípios de engenharia de software em um ambiente de aprendizado colaborativo."
                }
            }
        },
        "technical": {
            "title": "Habilidades Técnicas",
            "skills": {
                "Node.js & TypeScript": {
                    "description": "Desenvolvimento de serviços backend robustos e escaláveis com Node.js, TypeScript e Express."
                },
                "React & Next.js": {
                    "description": "Criação de aplicações web interativas e performáticas utilizando frameworks modernos de frontend."
                },
                "PostgreSQL & Prisma": {
                    "description": "Modelagem e gerenciamento de bancos de dados relacionais com PostgreSQL e Prisma ORM."
                },
                "Arquitetura de Software & Padrões de Projeto": {
                    "description": "Aplicação de padrões de projeto como Factory, Singleton e Use-Case para melhorar a manutenção do código."
                }
            }
        }
    },
    "blog": {
        "label": "Blog",
        "title": "Escrevendo sobre desenvolvimento de software...",
        "description": "Leia sobre os últimos aprendizados e experiências de Michael"
    },
    "work": {
        "label": "Trabalho",
        "title": "Meus Projetos",
        "description": "Projetos de desenvolvimento de software por Michael Morais"
    },
    "gallery": {
        "label": "Galeria",
        "title": "Minha Galeria de Fotos",
        "description": "Uma coleção de fotos por Michael Morais"
    },
    "projectCard": {
        "label": "Leia o Estudo de Caso"
    }
}
